#!/usr/bin/env python
# @Software: PyCharm
# @Time : 2023/5/10
# @Author : chenxuehong
# @Version：V 0.1
# @File : config.py
# @desc : 其他配置

# 默认验证码
default_code = '888888'

# 是否在活动中
is_activity = False

# 我的收藏个数配置
author_collect = 12
author_collect_group1 = 1
note_collect = 13
note_collect_group1 = 1
brand_collect = 13
kind_collect = 11
hot_keyword_collect = 15
# 我的监控个数配置
author_monitor = 1
note_monitor = 1
brand_business_monitor = 1
brand_sentiment_monitor = 0

# 环境配置
env = 'debug'
# 调试端配置ide/ios/android
platform = 'ide'
# 字体颜色
color = {
    'red': ['rgb(230, 74, 79)'],
    'default': ['rgb(100, 106, 115)']
}
# 博主性别筛选选项
gender_mapping = {
    '男': 1, '女': 2
}
# 粉丝性别筛选选项
fans_gender_mapping = {
    '男性居多': 1, '女性居多': 2
}
# 粉丝数筛选选项
fans_mapping = {
    '0-1000': 1,
    '1000-1W': 2,
    '1W-10W': 3,
    '10W-50W': 4,
    '50W-100W': 5,
    '100W+': 6
}
# 点赞数筛选选项
liked_mapping = {
    '0-200': 1,
    '200-500': 2,
    '500-1000': 3,
    '1000-5000': 4,
    '5000-1W': 5,
    '1W+': 6
}
# 互动量筛选选项
interaction_mapping = {
    '0-1000': 1,
    '1000-5000': 2,
    '5000-1W': 3,
    '1W-3W': 4,
    '3W-5W': 5,
    '5W+': 6
}
# 赞藏总数筛选选项
liked_and_collect_mapping = {
    '0-1W': 1,
    '1W-5W': 2,
    '5W-10W': 3,
    '10W-30W': 4,
    '30W-50W': 5,
    '50W+': 6
}
# 报价信息筛选选项
price_mapping = {
    '0-1000': 1,
    '1000-5000': 2,
    '5000-1W': 3,
    '1W-2W': 4,
    '2W+': 5
}
# 粉丝年龄筛选选项
fans_age_mapping = {
    '0-17': 1,
    '18-24': 2,
    '25-34': 3,
    '35-44': 4,
    '44+': 5
}
# 笔记数筛选选项
note_num_mapping = {
    '0': [1],
    '1-10': [2],
    '11-50': [3],
    '50+': [4],
}
# 笔记创建时间筛选选项
note_create_time_mapping = {
    '6小时': [0],
    '12小时': [1],
    '24小时': [2],
    '近3天': [3],
    '近7天': [4],
    '近15天': [5],
    '近30天': [6],
    '近90天': [7]
}
# 种草博主数筛选选项
author_num_mapping = {
    '1-10': 1,
    '10-30': 2,
    '30-50': 3,
    '50-100': 4,
    '100+': 5
}
# 其他标签筛选映射
other_label_mapping = {
    '美妆/装扮': 2,
    '科技/厨电': 3,
    '日用/宠物': 4,
    '美食/饮食': 5,
    '教育/母婴': 6
}
kindLib_times_mapping = {
    '近7天': [0],
    '近15天': [1],
    '近30天': [2],
    '近90天': [3],
    '近180天': [4],
    '近360天': [5]
}
hot_keyword_category_mapping = {
    '摄影': 1,
    '减肥': 2,
    '运动健身': 3,
    '美妆': 4
}
# 博主标签一级
first_label_mapping = {
    '全部': 0, '摄影': 1, '减肥': 2, '宠物': 3, '出行': 4, '运动健身': 5, '游戏': 6,
    '母婴': 7, '时尚': 8, '美妆': 9, '家居家装': 10, '情感': 11, '汽车': 12, '搞笑': 13,
    '健康': 14, '科技数码': 15, '教育': 16, '日常': 17, '体育赛事': 18, '素材': 19,
    '婚嫁': 20, '星座命理': 21, '民生资讯': 22, '美食': 23, '兴趣爱好': 24, '文化': 25,
    '影视': 26, '娱乐': 27, '萌娃': 28, '知识': 29
}
# 博主标签二级
second_label_mapping = {
    '全部': 0,
    '摄影技巧': 1, '写真': 2, '摄影器材': 3,
    '减肥饮食': 1, '减肥经验': 2, '减肥医药': 3, '减肥场所': 4,
    '猫': 1, '狗': 2, '宠物其他': 3,
    '餐厅': 1, '景点': 2, '购物地': 3, '攻略': 4, '酒店民宿': 5, '休闲娱乐场所': 6, '展览演出': 7,
    '运动': 1, '健身': 2, '减肥运动': 3,
    '手游': 1, '主机游戏': 2, '端游': 3,
    '孕产经验': 1, '婴童食品': 2, '育儿经验': 3, '妈妈经验': 4, '婴童用品': 5, '婴童时尚': 6, '早教': 7, '婴童洗护': 8,
    '孕期穿搭': 9,
    '穿搭': 1, '配饰': 2, '发型': 3, '箱包': 4, '鞋靴': 5,
    '护肤': 1, '彩妆': 2, '医美整形': 3, '美甲': 4, '个人护理': 5, '美妆合集': 6, '香水': 7, '粉底': 8,
    '家居装饰': 1, '装修': 2, '家居用品': 3, '家用电器': 4, '家具': 5, '居家经验': 6, '家居家装合集': 7,
    '两性': 1, '家庭': 2, '励志鸡汤': 3,
    '汽车介绍': 1, '道路交通': 2, '摩托车': 3, '汽车装饰': 4, '汽车文化': 5,
    '小剧场': 1, '搞笑其他': 2,
    '养生食疗': 1, '保健品': 2, '医疗药品': 3, '医疗方法': 4, '医疗器械': 5, '成人用品': 6,
    '数码': 1, '使用技巧': 2, '应用推荐': 3,
    '大学教育': 1, '中学教育': 2, '小学教育': 3, '学前教育': 4, '职业培训': 5, '外语教育': 6, '教育日常': 7,
    '生活日常': 1,
    '足球赛事': 1, '篮球赛事': 2, '其他赛事': 3,
    '头像': 1, '壁纸': 2, '文字素材': 3, '表情包': 4, '视频素材': 5,
    '婚礼造型': 1, '婚礼记录': 2, '婚礼经验': 3, '婚礼用品': 4, '婚礼场地': 5,
    '星座': 1,
    '楼市资讯': 1, '民生新闻': 2, '金融理财': 3,
    '正餐': 1, '面包甜点': 2, '饮品': 3, '零食': 4, '吃播': 5, '美食VLOG': 6, '佐料': 7,
    '手工': 1, '玩具': 2, '文具手账': 3, '书法': 4,
    '音乐': 1, '绘画': 2, '阅读': 3, '舞蹈': 4,
    '电视': 1, '动漫': 2, '影视推荐': 3, '影视片段': 4,
    '明星': 1, '娱乐': 2, '娱综评论': 3, '综艺片段': 4, '综艺': 5,
    '宝宝日常': 1, '宝宝写真': 2, '宝宝才艺': 3,
    '知识科普': 1, '生活科普': 2, '社科人文': 3, '科学科普': 4
}
# 粉丝标签
fans_label_mapping = {
    '全部': 0, '潮男潮女': 1, '旅行达人': 2, '美食吃货': 3, '少男少女': 4, '爱美少女': 5, '孕妇妈妈': 6, '带娃宝妈': 7,
    '家有萌娃': 8, '护肤党': 9, '彩妆党': 10, '网红潮人': 11, '追星族': 12, '摄影控': 13, '健身男女': 14, '瘦身男女': 15,
    '宅男宅女': 16, '爱家控': 17, '学生党': 18, '爱车一族': 19, '萌宠一族': 20, '两性学习': 21, '二次元萌宅': 22,
    '备婚青年': 23, '医美一族': 24
}
# 分类标签
category_mapping = {
    '全部': 0,
    '科技/厨电': {
        'id': 1,
        'sub_label': {
            '厨卫/电器': 1, '大家电': 2, '数码配件': 3, '电脑/硬件': 4, '网络设备': 5, '办公/耗材': 6, '网络/软件': 7,
            '科技数码': 8, '影音娱乐': 9, '文具/学习': 10, '商用设备': 11
        }
    },
    '美妆/装扮': {
        'id': 2,
        'sub_label': {
            '美妆工具': 1, '化妆护肤': 2, '香水彩妆': 3, '美发/护发': 4, '钟表珠宝': 5, '鞋子/袜子': 6, '服装/服饰': 7,
            '高端时尚奢侈': 8, '内衣裤/睡衣': 9, '箱包/配饰': 10
        }
    },
    '日用/宠物': {
        'id': 3,
        'sub_label': {
            '居家日用': 1, '宠物': 2, '个人护理': 3, '清洁/纸品': 4, '餐饮用具': 5
        }
    },
    '建材/家居': {
        'id': 4,
        'sub_label': {
            '家纺/布艺': 1, '照明/灯饰': 2, '家具/定制': 3, '建筑材料': 4, '门窗/楼梯': 5, '墙顶饰材': 6, '地面材料': 7,
            '洁具/五金': 8, '门禁安防': 9, '水电/电工': 10, '装饰木材': 11, '外墙材料': 12
        }
    },
    '美食/饮食': {
        'id': 5,
        'sub_label': {
            '调料调味': 1, '零食干果': 2, '乳品冲饮': 3, '研究茶叶': 4, '生鲜农产品': 5, '餐饮服务': 6,
            '特产熟食干货': 7, '粮油速食': 8, '面包糕点': 9
        }
    },
    '汽车/工具': {
        'id': 6,
        'sub_label': {
            '摩托车': 1, '飞机': 2, '非机动车': 3, '功能性车辆': 4, '二手车交易': 5, '汽车': 6, '工业机械设备': 7,
            '农用/农具': 8, '工具/维修': 9, '能源/化工': 10, '防护用品': 11, '车用品': 12, '仪器仪表': 13,
            '出行用车服务': 14, '工程机械设备': 15
        }
    },
    '健康/保障': {
        'id': 7,
        'sub_label': {
            '代餐': 1, '医疗机构': 2, '口腔医疗': 3, '医美': 4, '医疗器械': 5, '健身器材': 6, '医疗/护理': 7,
            '保健器械': 8, '保健品': 9, '医药用品': 10, '中药食材': 11
        }
    },
    '运动/娱乐': {
        'id': 8,
        'sub_label': {
            '室内娱乐': 1, '演出展览': 2, '体育赛事': 3, '运动体育': 4, '户外鞋服/装备': 5, '书刊/阅读': 6,
            '户外游戏': 7, '娱乐活动': 8
        }
    },
    '场景/空间': {
        'id': 9,
        'sub_label': {
            '客厅': 1, '卧室': 2, '餐厅': 3, '卫生间': 4, '阳台花园': 5, '功能区域': 6, '厨房': 7
        }
    },
    '服务相关': {
        'id': 10,
        'sub_label': {
            '家政服务': 1, '快递物流': 2, '回收租赁': 3, '婚庆摄影': 4, '美容美发': 5, '法律咨询': 6, '商务服务': 7,
            '餐饮服务': 8, '民办培训': 9, '房屋服务': 10, '金融保险': 11
        }
    },
    '教育/母婴': {
        'id': 11,
        'sub_label': {
            '兴趣培训': 1, '幼儿教育': 2, '中小学教育': 3, '学历教育': 4, '职业培训': 5, '企业拓展': 6, '语言留学': 7,
            '母婴用品': 8, '母婴食品': 9, '玩具/乐器': 10, '学校教育': 11
        }
    },
    '互联网': {
        'id': 12,
        'sub_label': {
            '新闻资讯': 1, '社交通讯': 2, '电子商务': 3, '视频影音': 4, '区块链': 5
        }
    },
    '出行服务': {
        'id': 13,
        'sub_label': {
            '酒店': 1, '景点': 2, '民宿': 3, '购物场所': 4, '休闲场所': 5, '主题公园': 6, '邮轮': 7,
        }
    },
    '游戏': {
        'id': 14,
        'sub_label': {
            '手游': 1, '端游': 2, '主机游戏': 3, '游戏平台': 4
        }
    },
    '文化传媒': {
        'id': 15,
        'sub_label': {
            '广播电视': 1, '出版发行': 2, '唱片电影': 3
        }
    },
    '工农业': {
        'id': 16,
        'sub_label': {
            '制造业': 1, '农林牧渔业': 2, '电子电气': 3, '工作制品': 4
        }
    },
    '房地产': {
        'id': 17,
        'sub_label': {
            '房地产开发商': 1, '房地产中介': 2, '物业管理': 3
        }
    }
}
# 红薯等级
author_level_mapping = {
    '哈利波特薯': 1, '偶像薯': 2, '明星薯': 3, '金冠薯': 4, '银冠薯': 5, '铜冠薯': 6, '文化薯': 7, '小马薯': 8,
    '甜筒薯': 9, '泡泡薯': 10, '困困薯': 11, '奶瓶薯': 12, '尿布薯': 13, '薯北鼻': 14,
}
# 省份
province_mapping = {
    '北京市': 1, '天津市': 2, '河北省': 3, '山西省': 4, '内蒙古自治区': 5, '辽宁省': 6, '吉林省': 7, '黑龙江省': 8, '上海市': 9,
    '江苏省': 10, '浙江省': 11, '安徽省': 12, '福建省': 13, '江西省': 14, '山东省': 15, '河南省': 16, '湖北省': 17, '湖南省': 18,
    '广东省': 19, '广西壮族自治区': 20, '海南省': 21, '重庆市': 22, '四川省': 23, '贵州省': 24, '云南省': 25, '西藏自治区': 26,
    '陕西省': 27, '甘肃省': 28, '青海省': 29, '宁夏回族自治区': 30, '新疆维吾尔自治区': 31, '台湾省': 32, '香港特别行政区': 33,
    '澳门特别行政区': 34
}
# 地区
city_mapping = {
    '不限': 0,
    '石家庄市': 1, '唐山市': 2, '秦皇岛市': 3, '邯郸市': 4, '邢台市': 5, '保定市': 6, '张家口市': 7, '承德市': 8, '沧州市': 9, '廊坊市': 10, '衡水市': 11,
    '太原市': 1, '大同市': 2, '阳泉市': 3, '长治市': 4, '晋城市': 5, '朔州市': 6, '晋中市': 7, '运城市': 8, '忻州市': 9, '临汾市': 10, '吕梁市': 11,
    '呼和浩特市': 1, '包头市': 2, '乌海市': 3, '赤峰市': 4, '通辽市': 5, '鄂尔多斯市': 6, '呼伦贝尔市': 7, '巴彦淖尔市': 8, '乌兰察布市': 9, '兴安盟': 10, '锡林郭勒盟': 11, '阿拉善盟': 12,
    '沈阳市': 1, '大连市': 2, '鞍山市': 3, '抚顺市': 4, '本溪市': 5, '丹东市': 6, '锦州市': 7, '营口市': 8, '阜新市': 9, '辽阳市': 10, '盘锦市': 11, '铁岭市': 12, '朝阳市': 13, '葫芦岛市': 14,
    '长春市': 1, '吉林市': 2, '四平市': 3, '辽源市': 4, '通化市': 5, '白山市': 6, '松原市': 7, '白城市': 8, '延边朝鲜族自治州': 9,
    '哈尔滨市': 1, '齐齐哈尔市': 2, '鸡西市': 3, '鹤岗市': 4, '双鸭山市': 5, '大庆市': 6, '伊春市': 7, '佳木斯市': 8, '七台河市': 9, '牡丹江市': 10, '黑河市': 11, '绥化市': 12, '大兴安岭地区': 13,
    '南京市': 1, '无锡市': 2, '徐州市': 3, '苏州市': 4, '南通市': 5, '连云港市': 6, '淮安市': 7, '盐城市': 8, '扬州市': 9, '镇江市': 10, '泰州市': 11, '宿迁市': 12, '常州市': 13,
    '杭州市': 1, '宁波市': 2, '温州市': 3, '嘉兴市': 4, '湖州市': 5, '绍兴市': 6, '金华市': 7, '衢州市': 8, '舟山市': 9, '台州市': 10, '丽水市': 11,
    '合肥市': 1, '芜湖市': 2, '蚌埠市': 3, '淮南市': 4, '马鞍山市': 5, '淮北市': 6, '铜陵市': 7, '安庆市': 8, '黄山市': 9, '除州市': 10, '阜阳市': 11, '宿州市': 12, '六安市': 13, '毫州市': 14, '池州市': 15, '宣城市': 16,
    '福州市': 1, '厦门市': 2, '莆田市': 3, '三明市': 4, '泉州市': 5, '漳州市': 6, '南平市': 7, '龙岩市': 8, '宁德市': 9,
    '南昌市': 1, '景德镇市': 2, '萍乡市': 3, '九江市': 4, '新余市': 5, '鹰潭市': 6, '赣州市': 7, '吉安市': 8, '宜春市': 9, '抚州市': 10, '上饶市': 11,
    '济南市': 1, '青岛市': 2, '淄博市': 3, '枣庄市': 4, '东营市': 5, '烟台市': 6, '潍坊市': 7, '济宁市': 8, '秦安市': 9, '威海市': 10, '日照市': 11, '莱芜市': 12, '临沂市': 13, '德州市': 14, '聊城市': 15, '滨州市': 16, '菏泽市': 17,
    '郑州市': 1, '开封市': 2, '洛阳市': 3, '平顶山市': 4, '安阳市': 5, '鹤壁市': 6, '新乡市': 7, '焦作市': 8, '濮阳市': 9, '许昌市': 10, '漯河市': 11, '三门峡市': 12, '南阳市': 13, '商丘市': 14, '信阳市': 15, '周口市': 16, '驻马店市': 17,
    '武汉市': 1, '黄石市': 2, '十堰市': 3, '宜昌市': 4, '襄阳市': 5, '鄂州市': 6, '荆门市': 7, '孝感市': 8, '荆州市': 9, '黄冈市': 10, '咸宁市': 11, '随州市': 12, '恩施土家族苗族自治州': 13, '仙桃市': 14, '潜江市': 15, '天门市': 16, '神龙架林区': 17,
    '长沙市': 1, '株洲市': 2, '湘潭市': 3, '衡阳市': 4, '邵阳市': 5, '岳阳市': 6, '常德市': 7, '张家界市': 8, '益阳市': 9, '郴州市': 10, '永州市': 11, '怀化市': 12, '娄底市': 13, '湘西土家苗族自治州': 14,
    '广州市': 1, '韶关市': 2, '深圳市': 3, '珠海市': 4, '汕头市': 5, '佛山市': 6, '江门市': 7, '湛江市': 8, '茂名市': 9, '肇庆市': 10, '惠州市': 11, '梅州市': 12, '汕尾市': 13, '河源市': 14, '阳江市': 15, '清远市': 16, '东莞市': 17, '中山市': 18, '潮州市': 19, '揭阳市': 20, '云浮市': 21,
    '防城港市': 1, '钦州市': 2, '贵港市': 3, '玉林市': 4, '百色市': 5, '贺州市': 6, '河池市': 7, '来宾市': 8, '崇左市': 9, '南宁市': 10, '柳州市': 11, '桂林市': 12, '梧州市': 13, '北海市': 14,
    '海口市': 1, '三亚市': 2, '儋州市': 3, '五指山市': 4, '琼海市': 5, '文昌市': 6, '万宁市': 7, '东方市': 8, '定安县': 9, '屯昌县': 10, '澄迈县': 11, '临高县': 12, '白沙黎族自治县': 13, '昌江黎族自治县': 14, '乐东黎族自治县': 15, '陵水黎族自治县': 16, '保亭黎族苗族自治县': 17, '琼中黎族苗族在这些': 18,
    '成都市': 1, '自贡市': 2, '攀枝花市': 3, '泸州市': 4, '德阳市': 5, '绵阳市': 6, '广元市': 7, '遂宁市': 8, '内江市': 9, '乐山市': 10, '南充市': 11, '眉山市': 12, '宜宾市': 13, '广安市': 14, '达州市': 15, '雅安市': 16, '巴中市': 17, '资阳市': 18, '阿坝藏族羌族自治州': 19, '甘孜藏族自治州': 20, '凉山彝族自治州': 21,
    '贵阳市': 1, '六盘水市': 2, '遵义市': 3, '安顺市': 4, '毕节市': 5, '铜仁市': 6, '黔西南布依族苗族自治州': 7, '黔西南苗族侗族自治州': 8, '黔南布依族苗族自治州': 9,
    '昆明市': 1, '曲靖市': 2, '玉溪市': 3, '保山市': 4, '昭通市': 5, '丽江市': 6, '普洱市': 7, '临沧市': 8, '楚雄彝族自治州': 9, '红河哈尼族彝族自治州': 10, '文山壮族苗族自治州': 11, '西双版纳傣族自治州': 12, '大理白族自治州': 13, '德宏傣族景颇族自治州': 14, '怒江傈僳族自治州': 15, '迪庆藏族自治州': 16,
    '拉萨市': 1, '日喀则市': 2, '昌都市': 3, '林芝市': 4, '山南市': 5, '那曲地区': 6, '阿里地区': 7,
    '西安市': 1, '铜川市': 2, '宝鸡市': 3, '咸阳市': 4, '渭南市': 5, '延安市': 6, '汉中市': 7, '榆林市': 8, '安康市': 9, '商洛市': 10,
    '兰州市': 1, '金昌市': 2, '白银市': 3, '天水市': 4, '武威市': 5, '平凉市': 6, '酒泉市': 7, '庆阳市': 8, '定西市': 9, '陇南市': 10, '临夏回族自治州': 11, '甘南藏族自治州': 12,
    '西宁市': 1, '海东市': 2, '海北藏族自治州': 3, '果洛藏族自治州': 4, '玉树藏族自治州': 5, '海西蒙古族藏族自治州': 6,
    '银川市': 1, '石嘴山市': 2, '吴忠市': 3, '固原市': 4, '中卫市': 5,
    '乌鲁木齐市': 1, '克拉玛依市': 2, '吐鲁番市': 3, '哈密市': 4, '昌吉回族自治州': 5, '博尔塔拉蒙古自治州': 6, '巴音郭楞蒙古自治州': 7, '阿克苏地区': 8, '克孜勒苏柯尔克孜自治州': 9, '喀什地区': 10, '和田地区': 11, '伊犁哈萨克自治州': 12, '塔城地区': 13, '阿勒泰地区': 14, '石河子市': 15, '阿拉尔市': 16, '图木舒克市': 17, '五家渠市': 18, '北屯市': 19, '双河市': 20, '可克达拉市': 21,
    '台北市': 1, '台中市': 2, '基隆市': 3, '台南市': 4, '新北市': 5, '桃园市': 6, '高雄市': 7, '新竹市': 8, '嘉义市': 9,
    '香港特别行政区': 1, '澳门特别行政区': 1
}

